import numpy as np

# 双目相机参数
class stereoCamera(object):
    def __init__(self):
        # 左相机内参
        self.cam_matrix_left = np.array([[648.4796, 0.,     488.3924],
                                        [0.,    648.6570,   313.2836],
                                        [0.,    0.,         1.]])
        # 右相机内参
        self.cam_matrix_right =  np.array([[652.9726,   0.,         464.2637],
                                            [0.,        653.0288,   297.3112],
                                            [0.,        0.,         1.]])

        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        # [0.0399 0.0671 2.3760e-04 0.0051 -0.6079
        #
        #  0.0081 0.0725  2.7426e-05 0.0052 -0.1545

        self.distortion_l = np.array([[0.0399, 0.0671, 2.3760e-04, 0.0051, -0.6079]])
        self.distortion_r = np.array([[0.0081, 0.0725, 2.7426e-05, 0.0052, -0.1545]])

        # 旋转矩阵
        self.R = np.array([[    1,      0.0073,     0.0042],
                            [   -0.0072,    1,      -0.0060],
                            [   -0.0042,    0.0059,     1]])

        # 平移矩阵
        self.T = np.array([[-136.3173], [-0.5544], [-1.9182]])

        # 焦距
        self.focal_length = 650.8429000000001  # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]

        # 基线距离
        self.baseline = 136.3173  # 单位：mm， 为平移向量的第一个参数（取绝对值）
